app/controllers/pstaffs_controller.rb

  def show
    @pstaffs = Pstaff.find(params[:id])
---
SELECT  `pstaffs`.* FROM `pstaffs` WHERE `pstaffs`.`id` = 1 LIMIT 1